**K-MEANS CLUSTERING**
** **

**Performs the "clustering" of data into groups by virtue of similarities between them**

**The goal of K-means is to partition data into K clusters, where each data point belongs to the cluster with the nearest mean**

**1. Initialization: Choose K initial centroids randomly from the data points.**

**2. Assignment: Assign each data point to the nearest centroid. This is usually done by calculating the Euclidean distance between each data point and identifying the closest point.**

**3. Update centroids: Once all data points are assigned to clusters, compute the new centroids of the clusters by taking the mean of all data points assigned to each cluster.**

**4. This is repeated until convergence. Convergence occurs when the centroids no longer change significantly or when a maximum number of iterations is reached.**

**5. Output: Once convergence is reached, the algorithm outputs the final clusters, with each data point belonging to the cluster of its nearest centroid.**

**Types of Clustering:**
** **


**1. Hierarchial Clustering (Tree like structure):** 

**Agglomerative: Bottom-up approach, each element begins as seperate cluster and then merges based on similarity.**

**Divisive: Top-down approach, begins with whole set and then break down into seperate clusters.**


**2. Partitional Clustering:**

**K-Means: Data is divided into 'K' number of clusters.**

**Fuzzy C-Means: Again divided into 'C' number of clusters but the datapoints can exist in multiple clusters at the same time.**

** **

**ELBOW METHOD TO DETERMINE 'K' VALUE**

**Plots the number of clusters against the within-cluster sum of squares (WCSS) which forms an elbow-like bend at the optimal number of clusters.**

**1. Start by running the K-means algorithm for a range of values of K, typically from 1 to some maximum value**

**2. Compute the within-cluster sum of squares (WCSS): For each value of K, calculate the sum of squared distances between each data point and its centroid within the cluster. This measure is also known as inertia. Smaller WCSS indicates tighter clusters.**

**3. Plot the number of clusters against the WCSS:**

**4. Identify the "elbow" point: Look for the point on the plot where the decrease in WCSS starts to slow down (the "elbow" point)**

**5. The optimal number of clusters is often chosen at the "elbow" point in the plot.**

In [17]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [21]:
sellers = pd.read_csv('D:/Code/Python Projects/ML Projects/FB Sellers K-Means Clustering/Seller Dataset.csv')

In [22]:
sellers.shape

(7050, 16)

In [28]:
sellers.head()

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys,Column1,Column2,Column3,Column4
0,1,video,4/22/2018 6:00,529,512,262,432,92,3,1,1,0,NaN,NaN,NaN,NaN
1,2,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0,NaN,NaN,NaN,NaN
2,3,video,4/21/2018 6:17,227,236,57,204,21,1,1,0,0,NaN,NaN,NaN,NaN
3,4,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0,NaN,NaN,NaN,NaN
4,5,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0,NaN,NaN,NaN,NaN

In [31]:
sellers.columns

Index(['status_id', 'status_type', 'status_published', 'num_reactions',
       'num_comments', 'num_shares', 'num_likes', 'num_loves', 'num_wows',
       'num_hahas', 'num_sads', 'num_angrys', 'Column1', 'Column2', 'Column3',
       'Column4'],
      dtype='object')

In [27]:
#We can see that there are 4 extra attributes in the dataset (Column 1-4). According to the dataset description, there are only supposed to be 
#supposed to be 12 columns. So drop the remaining.

In [32]:
sellers.drop(['Column1', 'Column2', 'Column3', 'Column4'], axis=1, inplace=True)

In [33]:
sellers.head()

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,1,video,4/22/2018 6:00,529,512,262,432,92,3,1,1,0
1,2,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0
2,3,video,4/21/2018 6:17,227,236,57,204,21,1,1,0,0
3,4,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0
4,5,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   status_id         7050 non-null   int64
 1   status_type       7050 non-null   object
 2   status_published  7050 non-null   object
 3   num_reactions     7050 non-null   int64
 4   num_comments      7050 non-null   int64
 5   num_shares        7050 non-null   int64
 6   num_likes         7050 non-null   int64
 7   num_loves         7050 non-null   int64
 8   num_wows          7050 non-null   int64
 9   num_hahas         7050 non-null   int64
 10  num_sads          7050 non-null   int64
 11  num_angrys        7050 non-null   int64
 12  Column1           0 non-null      float64
 13  Column2           0 non-null      float64
 14  Column3           0 non-null      float64
 15  Column4           0 non-null      float64
dtypes: float64(4), int64(10), object(2)
memory usage: 881.4+ KB

In [35]:
#We see that there are 3 non-numerical categorical features (0, 1, 2)
sellers['status_type'].unique()

array(['video', 'photo', 'link', 'status'], dtype=object)

In [40]:
X = sellers
y = sellers['status_type']

In [41]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
X['status_type'] = encoder.fit_transform(X['status_type'])
y = encoder.transform(y)

In [ ]:
cols = X.columns